def area(a, b):
    '''
    Возвращает площадь прямоугольника со сторонами a и b.
    
            Параметры:
                    a (float): первая сторона прямоугольника, выраженная вещественным числом
                    b (float): вторая сторона прямоугольника, выраженная вещественным числом
            
            Возвращаемое значение:
                    S (float): площадь прямоугольника со сторонами a и b
    '''
    return a*b

def perimeter(a, b):
    '''
    Возвращает периметр прямоугольника со сторонами a и b.
    
            Параметры:
                    a (float): первая сторона прямоугольника, выраженная вещественным числом
                    b (float): вторая сторона прямоугольника, выраженная вещественным числом
            
            Возвращаемое значение:
                    P (float): периметр прямоугольника со сторонами a и b
    '''
    return 2*(a+b)