
def area(a):
    '''
    Возвращает площадь квадрата со стороной a.

            Параметры:
                    a (float): сторона квадрата, выраженная вещественным числом
            
            Возвращаемое значение:
                    S (float): площадь квадрата со стороной a
    '''
    return a * a


def perimeter(a):
    '''
    Возвращает периметр квадрата со стороной a.

            Параметры:
                    a (float): сторона квадрата, выраженная вещественным числом
            
            Возвращаемое значение:
                    P (float): периметр квадрата со стороной a
    '''
    return 4 * a
